# DATA FOR TABLES

In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

import numpy as np

import warnings

In [3]:
actor = pd.read_csv('../data/actor_clean.csv')
category = pd.read_csv('../data/category_clean.csv')
film = pd.read_csv('../data/film_clean.csv')
inventory = pd.read_csv('../data/inventory_clean.csv')
language = pd.read_csv('../data/language_clean.csv')
old = pd.read_csv('../data/old_clean.csv')
rental = pd.read_csv('../data/rental_clean.csv')

### ACTORS

In [12]:
actor_table = actor

In [14]:
actor_table

     actor_id first_name     last_name          last_update
0           1   PENELOPE       GUINESS  2006-02-15 04:34:33
1           2       NICK      WAHLBERG  2006-02-15 04:34:33
2           3         ED         CHASE  2006-02-15 04:34:33
3           4   JENNIFER         DAVIS  2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33
..        ...        ...           ...                  ...
194       196       BELA        WALKEN  2006-02-15 04:34:33
195       197      REESE          WEST  2006-02-15 04:34:33
196       198       MARY        KEITEL  2006-02-15 04:34:33
197       199      JULIA       FAWCETT  2006-02-15 04:34:33
198       200      THORA        TEMPLE  2006-02-15 04:34:33

[199 rows x 4 columns]

In [15]:
actor_table.to_csv('../data/data_for_tables/actorTable.csv', sep=',', index=False)

### LANGUAJES

In [17]:
language_table  = language

In [18]:
language_table

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [19]:
language_table.to_csv('../data/data_for_tables/languageTable.csv', sep=',', index=False)

### CATEGORIES

In [21]:
category_table = category

In [22]:
category_table

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [23]:
category_table.to_csv('../data/data_for_tables/categoryTable.csv', sep=',', index=False)

### RENTALS

In [24]:
rental_table = rental

In [25]:
rental_table

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
995,997,2005-05-31 00:08:25,4243,216,2005-06-02 00:17:25,2,2006-02-15 21:30:53
996,998,2005-05-31 00:16:57,3395,389,2005-06-01 22:41:57,1,2006-02-15 21:30:53
997,999,2005-05-31 00:25:10,4433,413,2005-06-03 06:05:10,2,2006-02-15 21:30:53
998,1000,2005-05-31 00:25:56,1774,332,2005-06-08 19:42:56,2,2006-02-15 21:30:53
999,1001,2005-05-31 00:46:31,1498,64,2005-06-06 06:14:31,2,2006-02-15 21:30:53

In [26]:
rental_table.to_csv('../data/data_for_tables/rentalTable.csv', sep=',', index=False)

### INVENTORIES

In [28]:
inventory_table = inventory.drop(['film_id'], axis=1)

In [29]:
inventory_table

     inventory_id  store_id          last_update
0               1         1  2006-02-15 05:09:17
1               2         1  2006-02-15 05:09:17
2               3         1  2006-02-15 05:09:17
3               4         1  2006-02-15 05:09:17
4               5         2  2006-02-15 05:09:17
..            ...       ...                  ...
995           996         2  2006-02-15 05:09:17
996           997         2  2006-02-15 05:09:17
997           998         2  2006-02-15 05:09:17
998           999         2  2006-02-15 05:09:17
999          1000         2  2006-02-15 05:09:17

[1000 rows x 3 columns]

In [30]:
inventory_table.to_csv('../data/data_for_tables/inventoryTable.csv', sep=',', index=False)

### FILMS

In [52]:
film = film.drop(['language_id'], axis=1)

In [53]:
film

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [54]:
oldToFilm = old.drop(['first_name'], axis=1)
oldToFilm = oldToFilm.drop(['last_name'], axis=1)
oldToFilm = oldToFilm.drop(['release_year'], axis=1)

In [66]:
oldToFilm = oldToFilm.drop_duplicates()

In [67]:
oldToFilm

                     title  category_id
0         ACADEMY DINOSAUR            6
1     ANACONDA CONFESSIONS            2
2              ANGELS LIFE           13
3    BULWORTH COMMANDMENTS           10
4            CHEAPER CLYDE           14
..                     ...          ...
994         BINGO TALENTED           14
995      COMANCHEROS ENEMY            3
997        DESERT POSEIDON           11
998         EVERYONE CRAFT            9
999         EXORCIST STING           15

[614 rows x 2 columns]

In [68]:
film_table = film

In [69]:
film_table = film.join(oldToFilm.set_index('title'), on = 'title')

In [77]:
film_table[['category_id']] = film_table[['category_id']].fillna(0)

In [78]:
film_table = film_table.astype({'category_id': int}, errors = 'raise')

In [79]:
film_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   film_id           1000 non-null   int64
 1   title             1000 non-null   object
 2   description       1000 non-null   object
 3   release_year      1000 non-null   int64
 4   rental_duration   1000 non-null   int64
 5   rental_rate       1000 non-null   float64
 6   length            1000 non-null   int64
 7   replacement_cost  1000 non-null   float64
 8   rating            1000 non-null   object
 9   special_features  1000 non-null   object
 10  last_update       1000 non-null   object
 11  category_id       1000 non-null   int64
dtypes: float64(2), int64(5), object(5)
memory usage: 93.9+ KB

In [80]:
film_table.to_csv('../data/data_for_tables/filmTable.csv', sep=',', index=False)

### FILM_LANGUAGES

In [83]:
film = pd.read_csv('../data/film_clean.csv')

In [84]:
film

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-15 05:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-15 05:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42

In [85]:
film_language_table = film.drop(['title'], axis=1)
film_language_table = film_language_table.drop(['description'], axis=1)
film_language_table = film_language_table.drop(['release_year'], axis=1)
film_language_table = film_language_table.drop(['rental_duration'], axis=1)
film_language_table = film_language_table.drop(['rental_rate'], axis=1)
film_language_table = film_language_table.drop(['length'], axis=1)
film_language_table = film_language_table.drop(['replacement_cost'], axis=1)
film_language_table = film_language_table.drop(['rating'], axis=1)
film_language_table = film_language_table.drop(['special_features'], axis=1)
film_language_table = film_language_table.drop(['last_update'], axis=1)

In [88]:
film_language_table

     film_id  language_id
0          1            1
1          2            1
2          3            1
3          4            1
4          5            1
..       ...          ...
995      996            1
996      997            1
997      998            1
998      999            1
999     1000            1

[1000 rows x 2 columns]

In [89]:
film_language_table.to_csv('../data/data_for_tables/filmLanguageTable.csv', sep=',', index=False)

### FILM_INVENTORY

In [91]:
film_inventory_table = inventory.drop(['store_id'], axis=1)
film_inventory_table = film_inventory_table.drop(['last_update'], axis=1)

In [92]:
film_inventory_table

     inventory_id  film_id
0               1        1
1               2        1
2               3        1
3               4        1
4               5        1
..            ...      ...
995           996      222
996           997      222
997           998      222
998           999      223
999          1000      223

[1000 rows x 2 columns]

In [94]:
film_inventory_table.to_csv('../data/data_for_tables/filmInventoryTable.csv', sep=',', index=False)

### ACTOR_FILM

In [95]:
old

    first_name last_name                  title  release_year  category_id
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2     PENELOPE   GUINESS            ANGELS LIFE          2006           13
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006           14
..         ...       ...                    ...           ...          ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006            3
996     GOLDIE     BRODY        DAISY MENAGERIE          2006           14
997     GOLDIE     BRODY        DESERT POSEIDON          2006           11
998     GOLDIE     BRODY         EVERYONE CRAFT          2006            9
999     GOLDIE     BRODY         EXORCIST STING          2006           15

[1000 rows x 5 columns]

In [96]:
old_table =  old.drop(['category_id'], axis=1)

In [97]:
old_table

    first_name last_name                  title  release_year
0     PENELOPE   GUINESS       ACADEMY DINOSAUR          2006
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006
2     PENELOPE   GUINESS            ANGELS LIFE          2006
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006
4     PENELOPE   GUINESS          CHEAPER CLYDE          2006
..         ...       ...                    ...           ...
995     GOLDIE     BRODY      COMANCHEROS ENEMY          2006
996     GOLDIE     BRODY        DAISY MENAGERIE          2006
997     GOLDIE     BRODY        DESERT POSEIDON          2006
998     GOLDIE     BRODY         EVERYONE CRAFT          2006
999     GOLDIE     BRODY         EXORCIST STING          2006

[1000 rows x 4 columns]

In [98]:
old_table.to_csv('../data/data_for_tables/actorFilmTable.csv', sep=',', index=False)